//
//  Storage.swift
//  Navigation
//
//  Created by Pavel Belov on 18.06.2021.
//

import UIKit

struct Storage {
    var author: String
    var description: String
    var image: String
    var likes: Int
    var views: Int
}


let postOne = Storage (author: "Grizzly Bear",
                       description: "Так, что тут у нас? Фотоловушка? Ну ясно-ясно... - словно говорит этот гималайский медведь с 'Земли леопарда' и идет дальше по своим медвежьим делам, - комментируют сотрудники заказника. Эксперты поясняют, что в национальном парке действуют более 400 автоматических камер, поэтому животные особо не удивляются диковинной вещице. Камеры реагируют на движение и срабатывают во время прохода зверей перед объективом.  Помимо фотоснимков некоторые камеры заказника записывают видео. Это позволяет специалистам изучать поведение животных.",
                       image: "grizzlyPhoto",
                       likes: 777,
                       views: 1560)

let postTwo = Storage (author: "Grizzly Paparazzi",
                       description: "В канадской провинции Британская Колумбия записали на видео двух сражающихся на шоссе медведей гризли. На кадрах канадки Кари МакГилливрей видно, как звери сначала грозно рычат друг на друга, а затем встают на задние лапы и начинают сражаться. На заднем плане появляется волк, но он не приближается, издалека наблюдает за конфликтом. Заканчивается видео тем, что медведи бегут в сторону оператора. Ролик быстро стал вирусным, собрав за пару дней почти два миллиона просмотров.",
                       image: "grizzlyFight",
                       likes: 1,
                       views: 856)

let postThree = Storage (author: "Grizzly Dancer",
                         description: "В заповеднике 'Земля леопарда' сняли на видео танцующего медведя, который после эффектного выступления попробовал фотоловушку на зуб, сообщает пресс-служба заказника. Инцидент произошел на одной из приморских сопок. Словно позируя, навстречу камере вальяжно прошелся крупный гималайский медведь. Фотоловушка успела запечатлеть 'танец' косолапого во время почесывания спины у соседнего дерева, после чего зверь целенаправленно подошел к объективу. Будто решив уничтожить 'компромат', медведь сначала ударил камеру лапой, а затем вывел ее из строя при помощи зубов, - рассказывают сотрудники заповедника. - Однако 'вандалу' не удалось осуществить свой 'замысел' до конца: карта памяти осталась в устройстве. На сегодняшний день фотомониторинг – главный метод изучения дальневосточного леопарда. На территориях ФГБУ 'Земля леопарда' действуют более 400 фотоловушек – это крупнейшая сеть фотомониторинга диких животных в России. Камеры реагируют на движение и срабатывают во время прохода животных перед объективом. Помимо фотоснимков некоторые камеры заказника записывают видео. Это позволяет специалистам изучать поведение животных.", image: "grizzlyBite",
                         likes: 990,
                         views: 1656)

let postFour = Storage (author: "Mad Grizzly",
                        description: "Сотрудники Кроноцкого заповедника сфотографировали 'многоэтажное' поселение медведей. Медвежья многоэтажка на мысе Тугумынк на Курильском озере похоже на современный дом элитной застройки, - рассказала государственный инспектор Кроноцкого заповедника Лиана Варавская. По ее словам, у живущих тут медведей есть отдельные квартиры-берлоги с балконами-террасами, озелененными дикоросами и шикарным видом на озеро. Еще раз убеждаюсь, что медведи - большие эстеты! Лежат вот так на солнышке и созерцают окружающую красоту, - считает Лиана. Возможность наблюдать за дикими животными в их естественной среде привлекает туристов на Камчатку. Кроноцкий биосферный заповедник расположен на востоке полуострова, территория включает в себя Долину гейзеров, несколько вулканов и озер. На заповедной территории водятся бурые медведи, дикие северные олени, лоси, лисицы, росомахи, горностаи и другие животные.",
                        image: "grizzlySettling",
                        likes: 156,
                        views: 156)


var posts: [Storage] = [postOne, postTwo, postThree, postFour]

